## Task # 15:
- This is Task # 15 overall, But Task # 5 of Week 6
## Task # 05:

In [53]:
#importing regularly used libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [54]:
#importing the data set
fp = 'adult.csv'
adult_df = pd.read_csv(fp)

#this dataset has some missing values denoted by ?
adult_df.replace('?', np.nan, inplace=True)

#check for columns with null values

print(adult_df.columns[adult_df.isnull().any()])

#a look at the dataset
adult_df.head(3)

Index(['workclass', 'occupation', 'native-country'], dtype='object')

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K

#### Preprocessing

In [55]:
# all the columns which have null values are categorical columns so we will use Mode to replace NULL values
# Columns with null values
columns_with_null = ['workclass', 'occupation', 'native-country']

# Fill missing embarked with the most frequent value (mode)
for c in columns_with_null:
    adult_df[c] = adult_df[c].fillna(adult_df[c].mode()[0])

In [56]:
print(adult_df.columns[adult_df.isnull().any()])

Index([], dtype='object')

In [57]:
# a look at the information of dataset
adult_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  int64
 1   workclass        48842 non-null  object
 2   fnlwgt           48842 non-null  int64
 3   education        48842 non-null  object
 4   educational-num  48842 non-null  int64
 5   marital-status   48842 non-null  object
 6   occupation       48842 non-null  object
 7   relationship     48842 non-null  object
 8   race             48842 non-null  object
 9   gender           48842 non-null  object
 10  capital-gain     48842 non-null  int64
 11  capital-loss     48842 non-null  int64
 12  hours-per-week   48842 non-null  int64
 13  native-country   48842 non-null  object
 14  income           48842 non-null  object
dtypes: int64(6), object(9)
memory usage: 5.6+ MB

##### Making categories in certain columns

In [58]:
# Display the unique categories for each object type column
object_columns = adult_df.select_dtypes(include=['object']).columns

for column in object_columns:
    unique_values = adult_df[column].unique()
    print(f"Column: {column}")
    print(f"Unique Values ({len(unique_values)}): {unique_values}\n")

Column: workclass
Unique Values (8): ['Private' 'Local-gov' 'Self-emp-not-inc' 'Federal-gov' 'State-gov'
 'Self-emp-inc' 'Without-pay' 'Never-worked']

Column: education
Unique Values (16): ['11th' 'HS-grad' 'Assoc-acdm' 'Some-college' '10th' 'Prof-school'
 '7th-8th' 'Bachelors' 'Masters' 'Doctorate' '5th-6th' 'Assoc-voc' '9th'
 '12th' '1st-4th' 'Preschool']

Column: marital-status
Unique Values (7): ['Never-married' 'Married-civ-spouse' 'Widowed' 'Divorced' 'Separated'
 'Married-spouse-absent' 'Married-AF-spouse']

Column: occupation
Unique Values (14): ['Machine-op-inspct' 'Farming-fishing' 'Protective-serv' 'Prof-specialty'
 'Other-service' 'Craft-repair' 'Adm-clerical' 'Exec-managerial'
 'Tech-support' 'Sales' 'Priv-house-serv' 'Transport-moving'
 'Handlers-cleaners' 'Armed-Forces']

Column: relationship
Unique Values (6): ['Own-child' 'Husband' 'Not-in-family' 'Unmarried' 'Wife' 'Other-relative']

Column: race
Unique Values (5): ['Black' 'White' 'Asian-Pac-Islander' 'Other' 'Amer-Indian-Eskimo']

Column: gender
Unique Values (2): ['Male' 'Female']

Column: native-country
Unique Values (41): ['United-States' 'Peru' 'Guatemala' 'Mexico' 'Dominican-Republic'
 'Ireland' 'Germany' 'Philippines' 'Thailand' 'Haiti' 'El-Salvador'
 'Puerto-Rico' 'Vietnam' 'South' 'Columbia' 'Japan' 'India' 'Cambodia'
 'Poland' 'Laos' 'England' 'Cuba' 'Taiwan' 'Italy' 'Canada' 'Portugal'
 'China' 'Nicaragua' 'Honduras' 'Iran' 'Scotland' 'Jamaica' 'Ecuador'
 'Yugoslavia' 'Hungary' 'Hong' 'Greece' 'Trinadad&Tobago'
 'Outlying-US(Guam-USVI-etc)' 'France' 'Holand-Netherlands']

Column: income
Unique Values (2): ['<=50K' '>50K']

In [59]:
# education Category
adult_df.education = adult_df.education.replace(['Preschool', '1st-4th', '5th-6th', '7th-8th', '9th','10th', '11th', '12th'], 'school')
adult_df.education = adult_df.education.replace('HS-grad', 'high school')
adult_df.education = adult_df.education.replace(['Assoc-voc', 'Assoc-acdm', 'Prof-school', 'Some-college'], 'higher')
adult_df.education = adult_df.education.replace('Bachelors', 'undergrad')
adult_df.education = adult_df.education.replace('Masters', 'grad')
adult_df.education = adult_df.education.replace('Doctorate', 'doc')

In [60]:
#martial status
adult_df['marital-status'] = adult_df['marital-status'].replace(['Married-civ-spouse', 'Married-AF-spouse'], 'married')
adult_df['marital-status'] = adult_df['marital-status'].replace(['Never-married'], 'not-married')
adult_df['marital-status'] = adult_df['marital-status'].replace(['Divorced', 'Separated','Widowed',
                                                   'Married-spouse-absent'], 'other')

In [61]:
# income
#label encoding for the target variable
adult_df.loc[adult_df['income']=='<=50K','income',] = 0
adult_df.loc[adult_df['income']=='>50K','income',] = 1

adult_df['income'] = adult_df['income'].astype('int')

In [62]:
# adult_df.head(10)
#lets have a look at number of unique values in each column
# adult_df.nunique()

In [63]:
# a look at the information of dataset
# adult_df.info()

In [64]:
#standardization
from sklearn.preprocessing import StandardScaler

# Columns to standardize
columns_to_standardize = ['age', 'fnlwgt', 'capital-gain', 'capital-loss', 'hours-per-week']

scaler = StandardScaler()
adult_df[columns_to_standardize] = scaler.fit_transform(adult_df[columns_to_standardize])

In [65]:
#label Encoding
from sklearn.preprocessing import LabelEncoder
# Columns to encode
columns_to_encode = ['workclass', 'education', 'marital-status', 'occupation', 'relationship', 'race', 'gender', 'native-country']

le = LabelEncoder()

# Applying label encoding to each column
for col in columns_to_encode:
    le = LabelEncoder()
    adult_df[col] = le.fit_transform(adult_df[col])

In [67]:
# a look at the final form of dataset
adult_df.head(10)

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,-0.995129,3,0.351675,4,7,1,6,3,2,1,-0.144804,-0.217127,-0.034087,38,0
1,-0.046942,3,-0.945524,2,9,0,4,0,4,1,-0.144804,-0.217127,0.772930,38,0
2,-0.776316,1,1.394723,3,12,0,10,0,4,1,-0.144804,-0.217127,-0.034087,38,1
3,0.390683,3,-0.277844,3,10,0,6,0,2,1,0.886874,-0.217127,-0.034087,38,1
4,-1.505691,3,-0.815954,3,10,1,9,3,4,0,-0.144804,-0.217127,-0.841104,38,0
5,-0.338691,3,0.085498,4,6,1,7,1,4,1,-0.144804,-0.217127,-0.841104,38,0
6,-0.703379,3,0.353796,2,9,1,9,4,2,1,-0.144804,-0.217127,-0.034087,38,0
7,1.776496,5,-0.805263,3,15,0,9,0,4,1,0.271598,-0.217127,-0.679700,38,1
8,-1.068066,3,1.704525,3,10,1,7,4,4,0,-0.144804,-0.217127,-0.034087,38,0
9,1.192996,3,-0.801759,4,4,0,2,0,4,1,-0.144804,-0.217127,-2.455137,38,0

In [68]:
#Rechecking the information
adult_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  float64
 1   workclass        48842 non-null  int32
 2   fnlwgt           48842 non-null  float64
 3   education        48842 non-null  int32
 4   educational-num  48842 non-null  int64
 5   marital-status   48842 non-null  int32
 6   occupation       48842 non-null  int32
 7   relationship     48842 non-null  int32
 8   race             48842 non-null  int32
 9   gender           48842 non-null  int32
 10  capital-gain     48842 non-null  float64
 11  capital-loss     48842 non-null  float64
 12  hours-per-week   48842 non-null  float64
 13  native-country   48842 non-null  int32
 14  income           48842 non-null  int32
dtypes: float64(5), int32(9), int64(1)
memory usage: 3.9 MB